clean docs and add Loki
